Revit 2024 API
SpatialFieldManager.GetRegisteredResults Method
 Returns an array of indices of all registered results
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IList<int> GetRegisteredResults()
Visual Basic
Public Function GetRegisteredResults As IList(Of Integer)
Visual C++
public:
IList<int>^ GetRegisteredResults()
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace